Tekla Open API Reference for Tekla Structures 2025
Grid.Color Property
 Gets or sets the color of the grid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Color { get; set; }
Public Property Color As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Grid Class
Tekla.Structures.Model Namespace